In [1]:
import numpy as np
import pandas as pd
import re
import glob

In [11]:
employee = pd.read_csv('data/employees1.csv', index_col=0)
employee

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
4     John           IT
5    Billy           HR

In [12]:
hire_date = pd.read_csv('data/employees2.csv', index_col=0)
hire_date

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014
4     John       2010
5    Billy       2015

In [14]:
department = pd.read_csv('data/department.csv', index_col=0)
department

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve
3           IT       Jame

In [26]:
skills = pd.read_csv('data/skills.csv', index_col=0)
skills = skills.groupby('group').aggregate(list).reset_index()
skills

         group                        skills
0   Accounting          [math, spreadsheets]
1  Engineering               [coding, linux]
2           HR  [spreadsheets, organization]
3           IT                [coding, math]

In [33]:
salary = pd.read_csv('data/salary.csv', index_col=0)
salary.rename(columns={'name': 'employee'}, inplace=True)
salary

  employee  salary
0      Bob   70000
1     Jake   80000
2     Lisa  120000
3      Sue   90000
4     John  125000
5    Billy   92000

In [34]:
df = pd.merge(employee, hire_date, on='employee')
df = pd.merge(df, department, on='group')
df = pd.merge(df, skills, on='group')
df = pd.merge(df, salary, on='employee')
df

,employee,group,hire_date,supervisor,skills,salary
0,Bob,Accounting,2008,Carly,"[math, spreadsheets]",70000
1,Jake,Engineering,2012,Guido,"[coding, linux]",80000
2,Lisa,Engineering,2004,Guido,"[coding, linux]",120000
3,Sue,HR,2014,Steve,"[spreadsheets, organization]",90000
4,Billy,HR,2015,Steve,"[spreadsheets, organization]",92000
5,John,IT,2010,Jame,"[coding, math]",125000

In [39]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']})
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [40]:
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']})
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [45]:
df5 = pd.merge(df6, df7, on='name', how='outer')
df5

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer